
app.controller('postViewController', ['$scope', function($scope) {

    $scope.post = {
        type: 'нашел',
        title: 'Нашел кота',
        description: 'черный кот, красный ошейник, толстый, черный кот, красный ошейник, толстый, черный кот, красный ошейник, толстый, черный кот, красный ошейник, толстый, черный кот, красный ошейник, толстый',
        date: new Date(),
        img: "img/cat.jpg",
        latlng: [{lat: 53.899382, lng: 27.566698}, {lat: 53.900191, lng: 27.565432}, {lat: 53.900406, lng: 27.567170}],
        tags: ['нашел', 'кот', 'минск', 'толстый', 'ошейник']
    }
}]);