(function(){

    var post = {
        "id":"1",
        "postType":{"id":"2","name":"ищу"},
        "title":"убежал кот",
        "description":"убежал кот, черный, толстый, полосатый, убежал кот, черный, толстый, полосатый, убежал кот, черный, толстый, полосатый, убежал кот, черный, толстый, полосатый",
        "date":[2016,5,12],
        "lifetime":0,
        "hashTags":[{"id":"7","name":"убежал"},{"id":"3","name":"кот"}],
        "locations":[{"id":"1","lat":53.1234,"lng":27.4843,"address":"улица такая"},{"id":"2","lat":53.23456,"lng":27.0323,"address":"улица сякая"}],
        "locationArea":{"id":"1","lat":53.0,"lng":27.0,"address":"Минск, Беларусь","radius":300}
    };

    var posts = [{"id":"1","postType":{"id":"2","name":"ищу"},"title":"убежал кот","description":"убежал кот, черный, толстый, полосатый, убежал кот, черный, толстый, полосатый, убежал кот, черный, толстый, полосатый, убежал кот, черный, толстый, полосатый","date":[2016,5,12],"lifetime":0,"hashTags":[{"id":"7","name":"убежал"},{"id":"3","name":"кот"}],"locations":[{"id":"1","lat":53.90017,"lng":27.566553,"address":"ул. Кирова 47, Минск, Беларусь"},{"id":"2","lat":53.90073,"lng":27.568045,"address":"ул. Кирова 30, Минск, Беларусь"},{"id":"5","lat":53.899303,"lng":27.566435,"address":"ул. Красноармейская 6, Минск, Беларусь"}],"locationArea":{"id":"1","lat":53.90017,"lng":27.566553,"address":"ул. Кирова 47, Минск, Беларусь","radius":500}},{"id":"2","postType":{"id":"2","name":"ищу"},"title":"потерял кошелёк","description":"потерял кошелёк в районе пл.Победы, черный, много денег, потерял кошелёк в районе пл.Победы, черный, много денег, потерял кошелёк в районе пл.Победы, черный, много денег, потерял кошелёк в районе пл.Победы, черный, много денег","date":[2016,4,29],"lifetime":0,"hashTags":[{"id":"5","name":"кошелёк"},{"id":"8","name":"потерял"}],"locations":[{"id":"3","lat":53.909378,"lng":27.57492,"address":"ул. Киселёва 2, Минск, Беларусь"},{"id":"4","lat":53.909416,"lng":27.577347,"address":"проспект Независимости 42, Минск, Беларусь"},{"id":"6","lat":53.907963,"lng":27.576252,"address":"ул. Захарова 17, Минск, Беларусь"}],"locationArea":{"id":"2","lat":53.908592,"lng":27.576841,"address":"проспект Независимости 40б, Минск, Беларусь","radius":500}}]
});